#define _CRT_SECURE_NO_WARNINGS

//
////写一个函数，能够删除指定数字中的某个数字
////比如1234526
////删除2 后是13456
////在这里的思路是，有i和j同时遍历数组
////i负责遍历数组中的值是不是指定数字2
////j负责储存下标，当i发现指定数字，那么j不变
////j等待i发现下一个不是2的数字然后将其填入下标为j的数组中。
//#include <stdio.h>
//
//int Del(int arr[], int sz, int a)
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0,j = 0; i < sz; i++)
//	{
//		if(arr[i] != a)//如果不等于a就赋值，然后j++
//		{
//			arr[j] = arr[i];
//			j++;
//		}
//	}
//	return j;//返回删除后数组的长度
//}
//int main()
//{
//
//	//填入数字到数组
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("请输入下标为%d数字:>", i);
//		scanf("%d", &arr[i]);
//	}
//	//输入要删除的数字
//	int a = 0;
//	printf("请输入要删除的数字:>");
//	scanf("%d", &a);
//	//删除函数
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	int num = Del(arr, sz, a);
//	//打印删除后的函数
//	for (i = 0; i < num; i++)
//	{
//		printf("%d", arr[i]);
//	}
//	return 0;
//}

////输入10个整数成绩，求最高和最低分之差
////分数范围为0 - 100
////思路，边输入边找最大值和最小值
//#include <stdio.h>
//int main()
//{
//	int a = 0;
//	int max = 0;
//	int min = 100;
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("\n输入第%d个数字:>", i + 1);
//		scanf("%d", &a);
//		if (a > max)
//		{
//			max = a;
//		}
//		if (a < min)
//		{
//			min = a;
//		}
//	}
//	printf("最大值和最小值的差是：%d", max - min);
//	return 0;
//}



////写一个程序，输入a他输出A
////输入A他输出a
//
//#include<stdio.h>
//
//int main()
//{
//	char n = 0;
//	while (scanf("%c", &n)== 1)//有输入则返回1
//	{
//		if (n >= 'a' && n <= 'z')
//		{
//			printf("%c\n", n - 32);
//		}
//		//如果不加这个if 需要用getchar来把后面的\n吃掉
//		//或者在输入的时候，在%c之前加空格， 意思就是跳过所有的空白字符
//		//scanf(" %c", &n)== 1
//		else if (n >= 'A' && n <= 'Z')
//		{
//			printf("%c\n", n + 32);
//		}
//	}
//	return 0;
//}



////描述
////变种水仙花数 - Lily Number : 把任意的数字，从中间拆分成两个数字，
//// 比如1461可以拆分成(1和461)，(14和61)，(146和1), 
//// 如果所有拆分后的乘积之和等于自身，则是一个Lily Number.
////例如 :
////	655 = 6 * 55 + 65 * 5
////	1461 = 1 * 461 + 14 * 61 + 146 * 1
////	求出 5位数中的所有 Lily Number。
////输出描述 :
////一行，5位数中的所有 Lily Number，每两个数之间间隔一个空格。
// 
////思路，五位数中， 
//// 前4个数字是54321/10  最后1个数字是54321%10
//// 前3个数字是54321/100 最后2个数字是54321%100
////...
//// 第1个数字是54321/10000 最后4个数字是54321%10000
//
//#include <stdio.h>
//#include <math.h>//数学头文件
//int main()
//{
//	int i = 0;
//	for ( i = 10000; i <= 99999; i++)
//	{
//		int sum = 0;
//		int j = 0;
//		for (j = 1; j <= 4; j++)
//		{
//			int k = (int)pow(10, j);//pow为次幂函数得到的值是double类型
//			sum += (i / k) * (i % k);
//		}
//		if (sum == i)
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;
//}

